# When should I use the ''inplace'' parameter in pandas?

In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.shape

(18241, 5)

In [4]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [6]:
ufo.drop('City', axis = 1).head()

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00
3             NaN           DISK    KS   6/1/1931 13:00
4             NaN          LIGHT    NY  4/18/1933 19:00

In [18]:
ufo.head(10)

                 Colors Reported Shape Reported State
Time
6/1/1930 22:00               NaN       TRIANGLE    NY
6/30/1930 20:00              NaN          OTHER    NJ
2/15/1931 14:00              NaN           OVAL    CO
6/1/1931 13:00               NaN           DISK    KS
4/18/1933 19:00              NaN          LIGHT    NY
9/15/1934 15:30              NaN           DISK    ND
6/15/1935 0:00               NaN         CIRCLE    CA
7/15/1936 0:00               NaN           DISK    MI
10/15/1936 17:00             NaN          CIGAR    AK
6/15/1937 0:00               NaN       CYLINDER    OR

In [8]:
# inplace 默認是False，所以不會替代原資料
ufo.drop('City', axis = 1, inplace = True)

In [9]:
ufo.head()

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00
3             NaN           DISK    KS   6/1/1931 13:00
4             NaN          LIGHT    NY  4/18/1933 19:00

In [11]:
#‘any’ : If any NA values are present, drop that row or column.
#‘all’ : If all values are NA, drop that row or column.
ufo.dropna(how = 'any').shape

(2490, 4)

In [14]:
ufo.set_index('Time', inplace = True)

In [20]:
ufo.tail()

                 Colors Reported Shape Reported State
Time
12/31/2000 23:00             NaN       TRIANGLE    IL
12/31/2000 23:00             NaN           DISK    IA
12/31/2000 23:45             NaN            NaN    WI
12/31/2000 23:45             RED          LIGHT    WI
12/31/2000 23:59             NaN           OVAL    FL

In [22]:
# ffill: propagate last valid observation forward to next valid backfill (往前)
# bfill: use next valid observation to fill gap. (往後)
ufo.fillna(method = 'ffill').tail()

                 Colors Reported Shape Reported State
Time
12/31/2000 23:00             RED       TRIANGLE    IL
12/31/2000 23:00             RED           DISK    IA
12/31/2000 23:45             RED           DISK    WI
12/31/2000 23:45             RED          LIGHT    WI
12/31/2000 23:59             RED           OVAL    FL